betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_usart.c
  [..]
    The DAL_USART_Init() function follows the USART  synchronous configuration
    procedures (details for the procedures are available in reference manual).

@endverbatim
  * @{
  */

/**
  * @brief  Initialize the USART mode according to the specified
  *         parameters in the USART_InitTypeDef and initialize the associated handle.
  * @param  husart Pointer to a USART_HandleTypeDef structure that contains
  *                the configuration information for the specified USART module.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_USART_Init(USART_HandleTypeDef *husart)
{
  /* Check the USART handle allocation */
  if (husart == NULL)
  {
    return DAL_ERROR;
  }

  /* Check the parameters */
  ASSERT_PARAM(IS_USART_INSTANCE(husart->Instance));

  if (husart->State == DAL_USART_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    husart->Lock = DAL_UNLOCKED;

#if (USE_DAL_USART_REGISTER_CALLBACKS == 1)
    USART_InitCallbacksToDefault(husart);

    if (husart->MspInitCallback == NULL)
    {
      husart->MspInitCallback = DAL_USART_MspInit;
    }

    /* Init the low level hardware */
    husart->MspInitCallback(husart);
#else
    /* Init the low level hardware : GPIO, CLOCK */
    DAL_USART_MspInit(husart);
#endif /* USE_DAL_USART_REGISTER_CALLBACKS */
  }

  husart->State = DAL_USART_STATE_BUSY;

  /* Set the USART Communication parameters */
  USART_SetConfig(husart);

  /* In USART mode, the following bits must be kept cleared:
     - LINEN bit in the USART_CTRL2 register
     - HDSEL, SCEN and IREN bits in the USART_CTRL3 register */
  CLEAR_BIT(husart->Instance->CTRL2, USART_CTRL2_LINMEN);
  CLEAR_BIT(husart->Instance->CTRL3, (USART_CTRL3_SCEN | USART_CTRL3_HDEN | USART_CTRL3_IREN));

  /* Enable the Peripheral */
  __DAL_USART_ENABLE(husart);

  /* Initialize the USART state */
  husart->ErrorCode = DAL_USART_ERROR_NONE;
  husart->State = DAL_USART_STATE_READY;

  return DAL_OK;
}

/**
  * @brief  DeInitializes the USART peripheral.
  * @param  husart Pointer to a USART_HandleTypeDef structure that contains
  *                the configuration information for the specified USART module.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_USART_DeInit(USART_HandleTypeDef *husart)
{
  /* Check the USART handle allocation */
  if (husart == NULL)
  {
    return DAL_ERROR;
  }

  /* Check the parameters */
  ASSERT_PARAM(IS_USART_INSTANCE(husart->Instance));

  husart->State = DAL_USART_STATE_BUSY;

  /* Disable the Peripheral */
  __DAL_USART_DISABLE(husart);

#if (USE_DAL_USART_REGISTER_CALLBACKS == 1)
  if (husart->MspDeInitCallback == NULL)
  {
    husart->MspDeInitCallback = DAL_USART_MspDeInit;
  }
  /* DeInit the low level hardware */
  husart->MspDeInitCallback(husart);
#else
  /* DeInit the low level hardware */
  DAL_USART_MspDeInit(husart);
#endif /* USE_DAL_USART_REGISTER_CALLBACKS */

  husart->ErrorCode = DAL_USART_ERROR_NONE;
  husart->State = DAL_USART_STATE_RESET;

  /* Release Lock */
  __DAL_UNLOCK(husart);

  return DAL_OK;
}

/**
  * @brief  USART MSP Init.
  * @param  husart Pointer to a USART_HandleTypeDef structure that contains
  *                the configuration information for the specified USART module.
  * @retval None
  */
__weak void DAL_USART_MspInit(USART_HandleTypeDef *husart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(husart);
  /* NOTE: This function should not be modified, when the callback is needed,
           the DAL_USART_MspInit could be implemented in the user file
   */
}

/**
  * @brief  USART MSP DeInit.
  * @param  husart Pointer to a USART_HandleTypeDef structure that contains
  *                the configuration information for the specified USART module.
  * @retval None
  */
__weak void DAL_USART_MspDeInit(USART_HandleTypeDef *husart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(husart);
  /* NOTE: This function should not be modified, when the callback is needed,
           the DAL_USART_MspDeInit could be implemented in the user file
   */
}

#if (USE_DAL_USART_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a User USART Callback
  *         To be used instead of the weak predefined callback
  * @param  husart usart handle
  * @param  CallbackID ID of the callback to be registered
  *         This parameter can be one of the following values:
  *           @arg @ref DAL_USART_TX_HALFCOMPLETE_CB_ID Tx Half Complete Callback ID
  *           @arg @ref DAL_USART_TX_COMPLETE_CB_ID Tx Complete Callback ID
  *           @arg @ref DAL_USART_RX_HALFCOMPLETE_CB_ID Rx Half Complete Callback ID
  *           @arg @ref DAL_USART_RX_COMPLETE_CB_ID Rx Complete Callback ID
  *           @arg @ref DAL_USART_TX_RX_COMPLETE_CB_ID Rx Complete Callback ID
  *           @arg @ref DAL_USART_ERROR_CB_ID Error Callback ID
  *           @arg @ref DAL_USART_ABORT_COMPLETE_CB_ID Abort Complete Callback ID
  *           @arg @ref DAL_USART_MSPINIT_CB_ID MspInit Callback ID
  *           @arg @ref DAL_USART_MSPDEINIT_CB_ID MspDeInit Callback ID
  * @param  pCallback pointer to the Callback function
  * @retval DAL status
+  */
DAL_StatusTypeDef DAL_USART_RegisterCallback(USART_HandleTypeDef *husart, DAL_USART_CallbackIDTypeDef CallbackID,
                                             pUSART_CallbackTypeDef pCallback)
{
  DAL_StatusTypeDef status = DAL_OK;

  if (pCallback == NULL)
  {
    /* Update the error code */
    husart->ErrorCode |= DAL_USART_ERROR_INVALID_CALLBACK;

    return DAL_ERROR;
  }
  /* Process locked */
  __DAL_LOCK(husart);

  if (husart->State == DAL_USART_STATE_READY)
  {
    switch (CallbackID)
    {
      case DAL_USART_TX_HALFCOMPLETE_CB_ID :
        husart->TxHalfCpltCallback = pCallback;
        break;

      case DAL_USART_TX_COMPLETE_CB_ID :
        husart->TxCpltCallback = pCallback;
        break;

      case DAL_USART_RX_HALFCOMPLETE_CB_ID :
        husart->RxHalfCpltCallback = pCallback;
        break;

      case DAL_USART_RX_COMPLETE_CB_ID :
        husart->RxCpltCallback = pCallback;
        break;

      case DAL_USART_TX_RX_COMPLETE_CB_ID :
        husart->TxRxCpltCallback = pCallback;
        break;

      case DAL_USART_ERROR_CB_ID :
        husart->ErrorCallback = pCallback;
        break;

      case DAL_USART_ABORT_COMPLETE_CB_ID :
        husart->AbortCpltCallback = pCallback;
        break;

      case DAL_USART_MSPINIT_CB_ID :
        husart->MspInitCallback = pCallback;
        break;

      case DAL_USART_MSPDEINIT_CB_ID :
        husart->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        husart->ErrorCode |= DAL_USART_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else if (husart->State == DAL_USART_STATE_RESET)
  {
    switch (CallbackID)
    {
      case DAL_USART_MSPINIT_CB_ID :
        husart->MspInitCallback = pCallback;
        break;

      case DAL_USART_MSPDEINIT_CB_ID :
        husart->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        husart->ErrorCode |= DAL_USART_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    husart->ErrorCode |= DAL_USART_ERROR_INVALID_CALLBACK;

    /* Return error status */
    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(husart);

