betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_usart.c
  return status;
}

/**
  * @brief  Unregister an USART Callback
  *         USART callaback is redirected to the weak predefined callback
  * @param  husart usart handle
  * @param  CallbackID ID of the callback to be unregistered
  *         This parameter can be one of the following values:
  *           @arg @ref DAL_USART_TX_HALFCOMPLETE_CB_ID Tx Half Complete Callback ID
  *           @arg @ref DAL_USART_TX_COMPLETE_CB_ID Tx Complete Callback ID
  *           @arg @ref DAL_USART_RX_HALFCOMPLETE_CB_ID Rx Half Complete Callback ID
  *           @arg @ref DAL_USART_RX_COMPLETE_CB_ID Rx Complete Callback ID
  *           @arg @ref DAL_USART_TX_RX_COMPLETE_CB_ID Rx Complete Callback ID
  *           @arg @ref DAL_USART_ERROR_CB_ID Error Callback ID
  *           @arg @ref DAL_USART_ABORT_COMPLETE_CB_ID Abort Complete Callback ID
  *           @arg @ref DAL_USART_MSPINIT_CB_ID MspInit Callback ID
  *           @arg @ref DAL_USART_MSPDEINIT_CB_ID MspDeInit Callback ID
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_USART_UnRegisterCallback(USART_HandleTypeDef *husart, DAL_USART_CallbackIDTypeDef CallbackID)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Process locked */
  __DAL_LOCK(husart);

  if (husart->State == DAL_USART_STATE_READY)
  {
    switch (CallbackID)
    {
      case DAL_USART_TX_HALFCOMPLETE_CB_ID :
        husart->TxHalfCpltCallback = DAL_USART_TxHalfCpltCallback;               /* Legacy weak  TxHalfCpltCallback       */
        break;

      case DAL_USART_TX_COMPLETE_CB_ID :
        husart->TxCpltCallback = DAL_USART_TxCpltCallback;                       /* Legacy weak TxCpltCallback            */
        break;

      case DAL_USART_RX_HALFCOMPLETE_CB_ID :
        husart->RxHalfCpltCallback = DAL_USART_RxHalfCpltCallback;               /* Legacy weak RxHalfCpltCallback        */
        break;

      case DAL_USART_RX_COMPLETE_CB_ID :
        husart->RxCpltCallback = DAL_USART_RxCpltCallback;                       /* Legacy weak RxCpltCallback            */
        break;

      case DAL_USART_TX_RX_COMPLETE_CB_ID :
        husart->TxRxCpltCallback = DAL_USART_TxRxCpltCallback;                   /* Legacy weak TxRxCpltCallback            */
        break;

      case DAL_USART_ERROR_CB_ID :
        husart->ErrorCallback = DAL_USART_ErrorCallback;                         /* Legacy weak ErrorCallback             */
        break;

      case DAL_USART_ABORT_COMPLETE_CB_ID :
        husart->AbortCpltCallback = DAL_USART_AbortCpltCallback;                 /* Legacy weak AbortCpltCallback         */
        break;

      case DAL_USART_MSPINIT_CB_ID :
        husart->MspInitCallback = DAL_USART_MspInit;                             /* Legacy weak MspInitCallback           */
        break;

      case DAL_USART_MSPDEINIT_CB_ID :
        husart->MspDeInitCallback = DAL_USART_MspDeInit;                         /* Legacy weak MspDeInitCallback         */
        break;

      default :
        /* Update the error code */
        husart->ErrorCode |= DAL_USART_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else if (husart->State == DAL_USART_STATE_RESET)
  {
    switch (CallbackID)
    {
      case DAL_USART_MSPINIT_CB_ID :
        husart->MspInitCallback = DAL_USART_MspInit;
        break;

      case DAL_USART_MSPDEINIT_CB_ID :
        husart->MspDeInitCallback = DAL_USART_MspDeInit;
        break;

      default :
        /* Update the error code */
        husart->ErrorCode |= DAL_USART_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    husart->ErrorCode |= DAL_USART_ERROR_INVALID_CALLBACK;

    /* Return error status */
    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(husart);

  return status;
}
#endif /* USE_DAL_USART_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @defgroup USART_Exported_Functions_Group2 IO operation functions
  *  @brief   USART Transmit and Receive functions
  *
@verbatim
  ==============================================================================
                         ##### IO operation functions #####
  ==============================================================================
  [..]
    This subsection provides a set of functions allowing to manage the USART synchronous
    data transfers.

  [..]
    The USART supports master mode only: it cannot receive or send data related to an input
    clock (SCLK is always an output).

    (#) There are two modes of transfer:
        (++) Blocking mode: The communication is performed in polling mode.
             The DAL status of all data processing is returned by the same function
             after finishing transfer.
        (++) No-Blocking mode: The communication is performed using Interrupts
             or DMA, These API's return the DAL status.
             The end of the data processing will be indicated through the
             dedicated USART IRQ when using Interrupt mode or the DMA IRQ when
             using DMA mode.
             The DAL_USART_TxCpltCallback(), DAL_USART_RxCpltCallback() and DAL_USART_TxRxCpltCallback()
              user callbacks
             will be executed respectively at the end of the transmit or Receive process
             The DAL_USART_ErrorCallback() user callback will be executed when a communication
             error is detected

    (#) Blocking mode APIs are :
        (++) DAL_USART_Transmit() in simplex mode
        (++) DAL_USART_Receive() in full duplex receive only
        (++) DAL_USART_TransmitReceive() in full duplex mode

    (#) Non Blocking mode APIs with Interrupt are :
        (++) DAL_USART_Transmit_IT()in simplex mode
        (++) DAL_USART_Receive_IT() in full duplex receive only
        (++) DAL_USART_TransmitReceive_IT() in full duplex mode
        (++) DAL_USART_IRQHandler()

    (#) Non Blocking mode functions with DMA are :
        (++) DAL_USART_Transmit_DMA()in simplex mode
        (++) DAL_USART_Receive_DMA() in full duplex receive only
        (++) DAL_USART_TransmitReceive_DMA() in full duplex mode
        (++) DAL_USART_DMAPause()
        (++) DAL_USART_DMAResume()
        (++) DAL_USART_DMAStop()

    (#) A set of Transfer Complete Callbacks are provided in non Blocking mode:
        (++) DAL_USART_TxHalfCpltCallback()
        (++) DAL_USART_TxCpltCallback()
        (++) DAL_USART_RxHalfCpltCallback()
        (++) DAL_USART_RxCpltCallback()
        (++) DAL_USART_ErrorCallback()
        (++) DAL_USART_TxRxCpltCallback()

    (#) Non-Blocking mode transfers could be aborted using Abort API's :
        (++) DAL_USART_Abort()
        (++) DAL_USART_Abort_IT()

    (#) For Abort services based on interrupts (DAL_USART_Abort_IT), a Abort Complete Callbacks is provided:
        (++) DAL_USART_AbortCpltCallback()

