betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_usart.c
    /* Clear the Overrun flag just before enabling the DMA Rx request: mandatory for the second transfer */
    __DAL_USART_CLEAR_OREFLAG(husart);

    /* Process Unlocked */
    __DAL_UNLOCK(husart);

    if (husart->Init.Parity != USART_PARITY_NONE)
    {
      /* Enable the USART Parity Error Interrupt */
      SET_BIT(husart->Instance->CTRL1, USART_CTRL1_PEIEN);
    }

    /* Enable the USART Error Interrupt: (Frame error, noise error, overrun error) */
    SET_BIT(husart->Instance->CTRL3, USART_CTRL3_ERRIEN);

    /* Enable the DMA transfer for the receiver request by setting the DMAR bit
       in the USART CTRL3 register */
    SET_BIT(husart->Instance->CTRL3, USART_CTRL3_DMARXEN);

    /* Enable the DMA transfer for transmit request by setting the DMAT bit
       in the USART CTRL3 register */
    SET_BIT(husart->Instance->CTRL3, USART_CTRL3_DMATXEN);

    return DAL_OK;
  }
  else
  {
    return DAL_BUSY;
  }
}

/**
  * @brief  Full-Duplex Transmit Receive an amount of data in DMA mode.
  * @note   When USART parity is not enabled (PCE = 0), and Word Length is configured to 9 bits (M1-M0 = 01),
  *         the sent data and the received data are handled as sets of u16. In this case, Size must indicate the number
  *         of u16 available through pTxData and through pRxData.
  * @param  husart  Pointer to a USART_HandleTypeDef structure that contains
  *                 the configuration information for the specified USART module.
  * @param  pTxData Pointer to TX data buffer (u8 or u16 data elements).
  * @param  pRxData Pointer to RX data buffer (u8 or u16 data elements).
  * @param  Size    Amount of data elements (u8 or u16) to be received/sent.
  * @note   When the USART parity is enabled (PCE = 1) the data received contain the parity bit.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_USART_TransmitReceive_DMA(USART_HandleTypeDef *husart, const uint8_t *pTxData, uint8_t *pRxData,
                                                uint16_t Size)
{
  const uint32_t *tmp;

  if (husart->State == DAL_USART_STATE_READY)
  {
    if ((pTxData == NULL) || (pRxData == NULL) || (Size == 0))
    {
      return DAL_ERROR;
    }
    /* Process Locked */
    __DAL_LOCK(husart);

    husart->pRxBuffPtr = pRxData;
    husart->RxXferSize = Size;
    husart->pTxBuffPtr = pTxData;
    husart->TxXferSize = Size;

    husart->ErrorCode = DAL_USART_ERROR_NONE;
    husart->State = DAL_USART_STATE_BUSY_TX_RX;

    /* Set the USART DMA Rx transfer complete callback */
    husart->hdmarx->XferCpltCallback = USART_DMAReceiveCplt;

    /* Set the USART DMA Half transfer complete callback */
    husart->hdmarx->XferHalfCpltCallback = USART_DMARxHalfCplt;

    /* Set the USART DMA Tx transfer complete callback */
    husart->hdmatx->XferCpltCallback = USART_DMATransmitCplt;

    /* Set the USART DMA Half transfer complete callback */
    husart->hdmatx->XferHalfCpltCallback = USART_DMATxHalfCplt;

    /* Set the USART DMA Tx transfer error callback */
    husart->hdmatx->XferErrorCallback = USART_DMAError;

    /* Set the USART DMA Rx transfer error callback */
    husart->hdmarx->XferErrorCallback = USART_DMAError;

    /* Set the DMA abort callback */
    husart->hdmarx->XferAbortCallback = NULL;

    /* Enable the USART receive DMA stream */
    tmp = (uint32_t *)&pRxData;
    DAL_DMA_Start_IT(husart->hdmarx, (uint32_t)&husart->Instance->DATA, *(const uint32_t *)tmp, Size);

    /* Enable the USART transmit DMA stream */
    tmp = (const uint32_t *)&pTxData;
    DAL_DMA_Start_IT(husart->hdmatx, *(const uint32_t *)tmp, (uint32_t)&husart->Instance->DATA, Size);

    /* Clear the TC flag in the STS register by writing 0 to it */
    __DAL_USART_CLEAR_FLAG(husart, USART_FLAG_TC);

    /* Clear the Overrun flag: mandatory for the second transfer in circular mode */
    __DAL_USART_CLEAR_OREFLAG(husart);

    /* Process Unlocked */
    __DAL_UNLOCK(husart);

    if (husart->Init.Parity != USART_PARITY_NONE)
    {
      /* Enable the USART Parity Error Interrupt */
      SET_BIT(husart->Instance->CTRL1, USART_CTRL1_PEIEN);
    }

    /* Enable the USART Error Interrupt: (Frame error, noise error, overrun error) */
    SET_BIT(husart->Instance->CTRL3, USART_CTRL3_ERRIEN);

    /* Enable the DMA transfer for the receiver request by setting the DMAR bit
       in the USART CTRL3 register */
    SET_BIT(husart->Instance->CTRL3, USART_CTRL3_DMARXEN);

    /* Enable the DMA transfer for transmit request by setting the DMAT bit
       in the USART CTRL3 register */
    SET_BIT(husart->Instance->CTRL3, USART_CTRL3_DMATXEN);

    return DAL_OK;
  }
  else
  {
    return DAL_BUSY;
  }
}

/**
  * @brief  Pauses the DMA Transfer.
  * @param  husart Pointer to a USART_HandleTypeDef structure that contains
  *                the configuration information for the specified USART module.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_USART_DMAPause(USART_HandleTypeDef *husart)
{
  /* Process Locked */
  __DAL_LOCK(husart);

  /* Disable the USART DMA Tx request */
  CLEAR_BIT(husart->Instance->CTRL3, USART_CTRL3_DMATXEN);

  /* Process Unlocked */
  __DAL_UNLOCK(husart);

  return DAL_OK;
}

/**
  * @brief  Resumes the DMA Transfer.
  * @param  husart Pointer to a USART_HandleTypeDef structure that contains
  *                the configuration information for the specified USART module.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_USART_DMAResume(USART_HandleTypeDef *husart)
{
  /* Process Locked */
  __DAL_LOCK(husart);

  /* Enable the USART DMA Tx request */
  SET_BIT(husart->Instance->CTRL3, USART_CTRL3_DMATXEN);

  /* Process Unlocked */
  __DAL_UNLOCK(husart);

  return DAL_OK;
}

/**
  * @brief  Stops the DMA Transfer.
  * @param  husart Pointer to a USART_HandleTypeDef structure that contains
  *                the configuration information for the specified USART module.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_USART_DMAStop(USART_HandleTypeDef *husart)
{
  uint32_t dmarequest = 0x00U;
  /* The Lock is not implemented on this API to allow the user application
     to call the DAL USART API under callbacks DAL_USART_TxCpltCallback() / DAL_USART_RxCpltCallback():
     when calling DAL_DMA_Abort() API the DMA TX/RX Transfer complete interrupt is generated
     and the correspond call back is executed DAL_USART_TxCpltCallback() / DAL_USART_RxCpltCallback()
     */

  /* Stop USART DMA Tx request if ongoing */
  dmarequest = DAL_IS_BIT_SET(husart->Instance->CTRL3, USART_CTRL3_DMATXEN);
  if ((husart->State == DAL_USART_STATE_BUSY_TX) && dmarequest)
  {
    USART_EndTxTransfer(husart);

