betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_usart.c
      /* Enable the USART Transmit Complete Interrupt */
      SET_BIT(husart->Instance->CTRL1, USART_CTRL1_TXCIEN);
    }
  }
  /* DMA Circular mode */
  else
  {
    if (husart->State == DAL_USART_STATE_BUSY_TX)
    {
#if (USE_DAL_USART_REGISTER_CALLBACKS == 1)
      /* Call registered Tx Complete Callback */
      husart->TxCpltCallback(husart);
#else
      /* Call legacy weak Tx Complete Callback */
      DAL_USART_TxCpltCallback(husart);
#endif /* USE_DAL_USART_REGISTER_CALLBACKS */
    }
  }
}

/**
  * @brief  DMA USART transmit process half complete callback
  * @param  hdma Pointer to a DMA_HandleTypeDef structure that contains
  *              the configuration information for the specified DMA module.
  * @retval None
  */
static void USART_DMATxHalfCplt(DMA_HandleTypeDef *hdma)
{
  USART_HandleTypeDef *husart = (USART_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

#if (USE_DAL_USART_REGISTER_CALLBACKS == 1)
  /* Call registered Tx Half Complete Callback */
  husart->TxHalfCpltCallback(husart);
#else
  /* Call legacy weak Tx Half Complete Callback */
  DAL_USART_TxHalfCpltCallback(husart);
#endif /* USE_DAL_USART_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA USART receive process complete callback.
  * @param  hdma Pointer to a DMA_HandleTypeDef structure that contains
  *              the configuration information for the specified DMA module.
  * @retval None
  */
static void USART_DMAReceiveCplt(DMA_HandleTypeDef *hdma)
{
  USART_HandleTypeDef *husart = (USART_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;
  /* DMA Normal mode */
#if defined(APM32F403xx) || defined(APM32F402xx)
  if ((hdma->Instance->CHCFG & DMA_CHCFG_CIRMODE) == 0U)
#else
  if ((hdma->Instance->SCFG & DMA_SCFGx_CIRCMEN) == 0U)
#endif /* APM32F403xx || APM32F402xx */
  {
    husart->RxXferCount = 0x00U;

    /* Disable RXNE, PEIEN and ERRIEN (Frame error, noise error, overrun error) interrupts */
    CLEAR_BIT(husart->Instance->CTRL1, USART_CTRL1_PEIEN);
    CLEAR_BIT(husart->Instance->CTRL3, USART_CTRL3_ERRIEN);

    /* Disable the DMA transfer for the Transmit/receiver request by clearing the DMAT/DMAR bit
         in the USART CTRL3 register */
    CLEAR_BIT(husart->Instance->CTRL3, USART_CTRL3_DMARXEN);
    CLEAR_BIT(husart->Instance->CTRL3, USART_CTRL3_DMATXEN);

    /* The USART state is DAL_USART_STATE_BUSY_RX */
    if (husart->State == DAL_USART_STATE_BUSY_RX)
    {
#if (USE_DAL_USART_REGISTER_CALLBACKS == 1)
      /* Call registered Rx Complete Callback */
      husart->RxCpltCallback(husart);
#else
      /* Call legacy weak Rx Complete Callback */
      DAL_USART_RxCpltCallback(husart);
#endif /* USE_DAL_USART_REGISTER_CALLBACKS */
    }
    /* The USART state is DAL_USART_STATE_BUSY_TX_RX */
    else
    {
#if (USE_DAL_USART_REGISTER_CALLBACKS == 1)
      /* Call registered Tx Rx Complete Callback */
      husart->TxRxCpltCallback(husart);
#else
      /* Call legacy weak Tx Rx Complete Callback */
      DAL_USART_TxRxCpltCallback(husart);
#endif /* USE_DAL_USART_REGISTER_CALLBACKS */
    }
    husart->State = DAL_USART_STATE_READY;
  }
  /* DMA circular mode */
  else
  {
    if (husart->State == DAL_USART_STATE_BUSY_RX)
    {
#if (USE_DAL_USART_REGISTER_CALLBACKS == 1)
      /* Call registered Rx Complete Callback */
      husart->RxCpltCallback(husart);
#else
      /* Call legacy weak Rx Complete Callback */
      DAL_USART_RxCpltCallback(husart);
#endif /* USE_DAL_USART_REGISTER_CALLBACKS */
    }
    /* The USART state is DAL_USART_STATE_BUSY_TX_RX */
    else
    {
#if (USE_DAL_USART_REGISTER_CALLBACKS == 1)
      /* Call registered Tx Rx Complete Callback */
      husart->TxRxCpltCallback(husart);
#else
      /* Call legacy weak Tx Rx Complete Callback */
      DAL_USART_TxRxCpltCallback(husart);
#endif /* USE_DAL_USART_REGISTER_CALLBACKS */
    }
  }
}

/**
  * @brief  DMA USART receive process half complete callback
  * @param  hdma Pointer to a DMA_HandleTypeDef structure that contains
  *              the configuration information for the specified DMA module.
  * @retval None
  */
static void USART_DMARxHalfCplt(DMA_HandleTypeDef *hdma)
{
  USART_HandleTypeDef *husart = (USART_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

#if (USE_DAL_USART_REGISTER_CALLBACKS == 1)
  /* Call registered Rx Half Complete Callback */
  husart->RxHalfCpltCallback(husart);
#else
  /* Call legacy weak Rx Half Complete Callback */
  DAL_USART_RxHalfCpltCallback(husart);
#endif /* USE_DAL_USART_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA USART communication error callback.
  * @param  hdma Pointer to a DMA_HandleTypeDef structure that contains
  *              the configuration information for the specified DMA module.
  * @retval None
  */
static void USART_DMAError(DMA_HandleTypeDef *hdma)
{
  uint32_t dmarequest = 0x00U;
  USART_HandleTypeDef *husart = (USART_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;
  husart->RxXferCount = 0x00U;
  husart->TxXferCount = 0x00U;

  /* Stop USART DMA Tx request if ongoing */
  dmarequest = DAL_IS_BIT_SET(husart->Instance->CTRL3, USART_CTRL3_DMATXEN);
  if ((husart->State == DAL_USART_STATE_BUSY_TX) && dmarequest)
  {
    USART_EndTxTransfer(husart);
  }

  /* Stop USART DMA Rx request if ongoing */
  dmarequest = DAL_IS_BIT_SET(husart->Instance->CTRL3, USART_CTRL3_DMARXEN);
  if ((husart->State == DAL_USART_STATE_BUSY_RX) && dmarequest)
  {
    USART_EndRxTransfer(husart);
  }

  husart->ErrorCode |= DAL_USART_ERROR_DMA;
  husart->State = DAL_USART_STATE_READY;

#if (USE_DAL_USART_REGISTER_CALLBACKS == 1)
  /* Call registered Error Callback */
  husart->ErrorCallback(husart);
#else
  /* Call legacy weak Error Callback */
  DAL_USART_ErrorCallback(husart);
#endif /* USE_DAL_USART_REGISTER_CALLBACKS */
}

/**
  * @brief  This function handles USART Communication Timeout. It waits
  *         until a flag is no longer in the specified status.
  * @param  husart Pointer to a USART_HandleTypeDef structure that contains
  *                the configuration information for the specified USART module.
  * @param  Flag specifies the USART flag to check.
  * @param  Status The actual Flag status (SET or RESET).
  * @param  Tickstart Tick start value.
  * @param  Timeout Timeout duration.
  * @retval DAL status
  */
static DAL_StatusTypeDef USART_WaitOnFlagUntilTimeout(USART_HandleTypeDef *husart, uint32_t Flag, FlagStatus Status,
                                                      uint32_t Tickstart, uint32_t Timeout)
{
  /* Wait until flag is set */
  while ((__DAL_USART_GET_FLAG(husart, Flag) ? SET : RESET) == Status)
  {
    /* Check for the Timeout */
    if (Timeout != DAL_MAX_DELAY)
    {
      if ((Timeout == 0U) || ((DAL_GetTick() - Tickstart) > Timeout))
      {
        /* Disable the USART Transmit Complete Interrupt */
        CLEAR_BIT(husart->Instance->CTRL1, USART_CTRL1_TXBEIEN);

        /* Disable the USART RXNE Interrupt */
        CLEAR_BIT(husart->Instance->CTRL1, USART_CTRL1_RXBNEIEN);

        /* Disable the USART Parity Error Interrupt */
        CLEAR_BIT(husart->Instance->CTRL1, USART_CTRL1_PEIEN);

