betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_usart.c
  /* Disable the USART Error Interrupt: (Frame error, noise error, overrun error) */
  CLEAR_BIT(husart->Instance->CTRL3, USART_CTRL3_ERRIEN);

  husart->State = DAL_USART_STATE_READY;

#if (USE_DAL_USART_REGISTER_CALLBACKS == 1)
  /* Call registered Tx Complete Callback */
  husart->TxCpltCallback(husart);
#else
  /* Call legacy weak Tx Complete Callback */
  DAL_USART_TxCpltCallback(husart);
#endif /* USE_DAL_USART_REGISTER_CALLBACKS */

  return DAL_OK;
}

/**
  * @brief  Simplex Receive an amount of data in non-blocking mode.
  * @param  husart Pointer to a USART_HandleTypeDef structure that contains
  *                the configuration information for the specified USART module.
  * @retval DAL status
  */
static DAL_StatusTypeDef USART_Receive_IT(USART_HandleTypeDef *husart)
{
  uint8_t  *pdata8bits;
  uint16_t *pdata16bits;

  if (husart->State == DAL_USART_STATE_BUSY_RX)
  {
    if ((husart->Init.WordLength == USART_WORDLENGTH_9B) && (husart->Init.Parity == USART_PARITY_NONE))
    {
      pdata8bits  = NULL;
      pdata16bits = (uint16_t *) husart->pRxBuffPtr;
      *pdata16bits = (uint16_t)(husart->Instance->DATA & (uint16_t)0x01FF);
      husart->pRxBuffPtr += 2U;
    }
    else
    {
      pdata8bits = (uint8_t *) husart->pRxBuffPtr;
      pdata16bits  = NULL;

      if ((husart->Init.WordLength == USART_WORDLENGTH_9B) || ((husart->Init.WordLength == USART_WORDLENGTH_8B) && (husart->Init.Parity == USART_PARITY_NONE)))
      {
        *pdata8bits = (uint8_t)(husart->Instance->DATA & (uint8_t)0x00FF);
      }
      else
      {
        *pdata8bits = (uint8_t)(husart->Instance->DATA & (uint8_t)0x007F);
      }

      husart->pRxBuffPtr += 1U;
    }

    husart->RxXferCount--;

    if (husart->RxXferCount == 0U)
    {
      /* Disable the USART RXNE Interrupt */
      CLEAR_BIT(husart->Instance->CTRL1, USART_CTRL1_RXBNEIEN);

      /* Disable the USART Parity Error Interrupt */
      CLEAR_BIT(husart->Instance->CTRL1, USART_CTRL1_PEIEN);

      /* Disable the USART Error Interrupt: (Frame error, noise error, overrun error) */
      CLEAR_BIT(husart->Instance->CTRL3, USART_CTRL3_ERRIEN);

      husart->State = DAL_USART_STATE_READY;
#if (USE_DAL_USART_REGISTER_CALLBACKS == 1)
      /* Call registered Rx Complete Callback */
      husart->RxCpltCallback(husart);
#else
      /* Call legacy weak Rx Complete Callback */
      DAL_USART_RxCpltCallback(husart);
#endif /* USE_DAL_USART_REGISTER_CALLBACKS */

      return DAL_OK;
    }
    else
    {
      /* Send dummy byte in order to generate the clock for the slave to send the next data.
      * Whatever the frame length (7, 8 or 9-bit long), the same dummy value
      * can be written for all the cases. */
      husart->Instance->DATA = (DUMMY_DATA & (uint16_t)0x0FF);
    }
    return DAL_OK;
  }
  else
  {
    return DAL_BUSY;
  }
}

/**
  * @brief  Full-Duplex Send receive an amount of data in full-duplex mode (non-blocking).
  * @param  husart Pointer to a USART_HandleTypeDef structure that contains
  *                the configuration information for the specified USART module.
  * @retval DAL status
  */
static DAL_StatusTypeDef USART_TransmitReceive_IT(USART_HandleTypeDef *husart)
{
  const uint16_t *pdatatx16bits;
  uint16_t *pdatarx16bits;

  if (husart->State == DAL_USART_STATE_BUSY_TX_RX)
  {
    if (husart->TxXferCount != 0x00U)
    {
      if (__DAL_USART_GET_FLAG(husart, USART_FLAG_TXE) != RESET)
      {
        if ((husart->Init.WordLength == USART_WORDLENGTH_9B) && (husart->Init.Parity == USART_PARITY_NONE))
        {
          pdatatx16bits = (const uint16_t *) husart->pTxBuffPtr;
          husart->Instance->DATA = (uint16_t)(*pdatatx16bits & (uint16_t)0x01FF);
          husart->pTxBuffPtr += 2U;
        }
        else
        {
          husart->Instance->DATA = (uint8_t)(*husart->pTxBuffPtr++ & (uint8_t)0x00FF);
        }

        husart->TxXferCount--;

        /* Check the latest data transmitted */
        if (husart->TxXferCount == 0U)
        {
          CLEAR_BIT(husart->Instance->CTRL1, USART_CTRL1_TXBEIEN);
        }
      }
    }

    if (husart->RxXferCount != 0x00U)
    {
      if (__DAL_USART_GET_FLAG(husart, USART_FLAG_RXNE) != RESET)
      {
        if ((husart->Init.WordLength == USART_WORDLENGTH_9B) && (husart->Init.Parity == USART_PARITY_NONE))
        {
          pdatarx16bits = (uint16_t *) husart->pRxBuffPtr;
          *pdatarx16bits = (uint16_t)(husart->Instance->DATA & (uint16_t)0x01FF);
          husart->pRxBuffPtr += 2U;
        }
        else
        {
          if ((husart->Init.WordLength == USART_WORDLENGTH_9B) || ((husart->Init.WordLength == USART_WORDLENGTH_8B) && (husart->Init.Parity == USART_PARITY_NONE)))
          {
            *husart->pRxBuffPtr = (uint8_t)(husart->Instance->DATA & (uint8_t)0x00FF);
          }
          else
          {
            *husart->pRxBuffPtr = (uint8_t)(husart->Instance->DATA & (uint8_t)0x007F);
          }
          husart->pRxBuffPtr += 1U;
        }

        husart->RxXferCount--;
      }
    }

    /* Check the latest data received */
    if (husart->RxXferCount == 0U)
    {
      /* Disable the USART RXBNEIEN Interrupt */
      CLEAR_BIT(husart->Instance->CTRL1, USART_CTRL1_RXBNEIEN);

      /* Disable the USART Parity Error Interrupt */
      CLEAR_BIT(husart->Instance->CTRL1, USART_CTRL1_PEIEN);

      /* Disable the USART Error Interrupt: (Frame error, noise error, overrun error) */
      CLEAR_BIT(husart->Instance->CTRL3, USART_CTRL3_ERRIEN);

      husart->State = DAL_USART_STATE_READY;

#if (USE_DAL_USART_REGISTER_CALLBACKS == 1)
      /* Call registered Tx Rx Complete Callback */
      husart->TxRxCpltCallback(husart);
#else
      /* Call legacy weak Tx Rx Complete Callback */
      DAL_USART_TxRxCpltCallback(husart);
#endif /* USE_DAL_USART_REGISTER_CALLBACKS */

      return DAL_OK;
    }

    return DAL_OK;
  }
  else
  {
    return DAL_BUSY;
  }
}

/**
  * @brief  Configures the USART peripheral.
  * @param  husart Pointer to a USART_HandleTypeDef structure that contains
  *                the configuration information for the specified USART module.
  * @retval None
  */
static void USART_SetConfig(USART_HandleTypeDef *husart)
{
  uint32_t tmpreg = 0x00U;
  uint32_t pclk;

  /* Check the parameters */
  ASSERT_PARAM(IS_USART_INSTANCE(husart->Instance));
  ASSERT_PARAM(IS_USART_POLARITY(husart->Init.CLKPolarity));
  ASSERT_PARAM(IS_USART_PHASE(husart->Init.CLKPhase));
  ASSERT_PARAM(IS_USART_LASTBIT(husart->Init.CLKLastBit));
  ASSERT_PARAM(IS_USART_BAUDRATE(husart->Init.BaudRate));
  ASSERT_PARAM(IS_USART_WORD_LENGTH(husart->Init.WordLength));
  ASSERT_PARAM(IS_USART_STOPBITS(husart->Init.StopBits));
  ASSERT_PARAM(IS_USART_PARITY(husart->Init.Parity));
  ASSERT_PARAM(IS_USART_MODE(husart->Init.Mode));

  /* The LBCL, CPOL and CPHA bits have to be selected when both the transmitter and the
     receiver are disabled (TE=RE=0) to ensure that the clock pulses function correctly. */
  CLEAR_BIT(husart->Instance->CTRL1, (USART_CTRL1_TXEN | USART_CTRL1_RXEN));

  /*---------------------------- USART CTRL2 Configuration ---------------------*/
  tmpreg = husart->Instance->CTRL2;
  /* Clear CLKEN, CPOL, CPHA and LBCL bits */
  tmpreg &= (uint32_t)~((uint32_t)(USART_CTRL2_CPHA | USART_CTRL2_CPOL | USART_CTRL2_CLKEN | USART_CTRL2_LBCPOEN | USART_CTRL2_STOPCFG));
  /* Configure the USART Clock, CPOL, CPHA and LastBit -----------------------*/
  /* Set CPOL bit according to husart->Init.CLKPolarity value */
  /* Set CPHA bit according to husart->Init.CLKPhase value */
  /* Set LBCL bit according to husart->Init.CLKLastBit value */
  /* Set Stop Bits: Set STOP[13:12] bits according to husart->Init.StopBits value */
  tmpreg |= (uint32_t)(USART_CLOCK_ENABLE | husart->Init.CLKPolarity |
                       husart->Init.CLKPhase | husart->Init.CLKLastBit | husart->Init.StopBits);
  /* Write to USART CTRL2 */
  WRITE_REG(husart->Instance->CTRL2, (uint32_t)tmpreg);

  /*-------------------------- USART CTRL1 Configuration -----------------------*/
  tmpreg = husart->Instance->CTRL1;

