betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_usart.c
#if defined(USART_CTRL1_OSMCFG)
  /* Clear M, PCE, PS, TE, RE and OVER8 bits */
  tmpreg &= (uint32_t)~((uint32_t)(USART_CTRL1_DBLCFG | USART_CTRL1_PCEN | USART_CTRL1_PCFG | USART_CTRL1_TXEN | \
                                   USART_CTRL1_RXEN | USART_CTRL1_OSMCFG));
#else
  /* Clear M, PCE, PS, TE and RE bits */
  tmpreg &= (uint32_t)~((uint32_t)(USART_CTRL1_DBLCFG | USART_CTRL1_PCEN | USART_CTRL1_PCFG | USART_CTRL1_TXEN | \
                                   USART_CTRL1_RXEN));
#endif /* USART_CTRL1_OSMCFG */

#if defined(USART_CTRL1_OSMCFG)
  /* Configure the USART Word Length, Parity and mode:
     Set the M bits according to husart->Init.WordLength value
     Set PCE and PS bits according to husart->Init.Parity value
     Set TE and RE bits according to husart->Init.Mode value
     Force OVER8 bit to 1 in order to reach the max USART frequencies */
  tmpreg |= (uint32_t)husart->Init.WordLength | husart->Init.Parity | husart->Init.Mode | USART_CTRL1_OSMCFG;
#else
  /* Configure the USART Word Length, Parity and mode:
     Set the M bits according to husart->Init.WordLength value
     Set PCE and PS bits according to husart->Init.Parity value
     Set TE and RE bits according to husart->Init.Mode value */
  tmpreg |= (uint32_t)husart->Init.WordLength | husart->Init.Parity | husart->Init.Mode;
#endif /* USART_CTRL1_OSMCFG */

  /* Write to USART CTRL1 */
  WRITE_REG(husart->Instance->CTRL1, (uint32_t)tmpreg);

  /*-------------------------- USART CTRL3 Configuration -----------------------*/
  /* Clear CTSEN and RTSEN bits */
  CLEAR_BIT(husart->Instance->CTRL3, (USART_CTRL3_RTSEN | USART_CTRL3_CTSEN));

  /*-------------------------- USART BR Configuration -----------------------*/
#if defined(USART6) && defined(UART9) && defined(UART10)
   if ((husart->Instance == USART1) || (husart->Instance == USART6) || (husart->Instance == UART9) || (husart->Instance == UART10))
   {
    pclk = DAL_RCM_GetPCLK2Freq();
    husart->Instance->BR = USART_BR(pclk, husart->Init.BaudRate);
   }
#elif defined(USART6)
  if((husart->Instance == USART1) || (husart->Instance == USART6))
  {
    pclk = DAL_RCM_GetPCLK2Freq();
    husart->Instance->BR = USART_BR(pclk, husart->Init.BaudRate);
  }
#else
  if(husart->Instance == USART1)
  {
    pclk = DAL_RCM_GetPCLK2Freq();
    husart->Instance->BR = USART_BR(pclk, husart->Init.BaudRate);
  }
#endif /* USART6 || UART9 || UART10 */	
  else
  {
    pclk = DAL_RCM_GetPCLK1Freq();
    husart->Instance->BR = USART_BR(pclk, husart->Init.BaudRate);
  }
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* DAL_USART_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

